977
1165
1494
1563
387
1018
156
1376
191
561
625
1415
948
1540
971
617
503
1364
220
316
816
1319
314
989
160
442
901
140
613
675
1190
466
361
59
1355
1290
86
1449
23
203
1393
591
780
1219
840
1215
1308
240
665
455
376
670
1216
1562
805
1373
1034
45
993
925
1079
1037
1092
1136
1118
374
506
1570
305
786
239
400
1299
1258
401
141
1585
997
807
234
22
168
857
555
714
602
1070
379
497
1142
173
196
406
1470
1461
1365
810
593
175
1588
459
594
87
1065
950
624
641
1101
15
576
16
1194
432
1589
740
983
1032
1498
1576
887
995
804
35
998
915
144
1197
1057
880
1097
460
1574
1477
892
662
486
596
268
341
309
394
1437
251
945
275
1027
1526
836
383
1533
1377
1104
1409
242
693
1212
569
1276
1211
658
1529
133
66
310
981
1502
328
1469
77
136
436
1029
46
2
373
483
1571
774
114
955
1499
520
1325
793
832
968
1225
1283
704
1490
211
579
299
659
216
773
63
355
1575
53
1489
1270
93
1084
1354
676
1555
1503
238
88
525
1395
274
1179
38
749
6
878
1565
1374
1261
186
344
1116
67
340
1327
912
128
501
792
129
209
1252
381
496
720
791
92
956
1334
1169
1242
1099
578
1128
1416
1417
371
269
697
1463
1362
1551
106
1158
1014
68
1548
1234
940
1264
75
103
1015
893
333
285
682
1476
423
204
250
142
479
343
1082
544
476
1236
352
1096
100
690
366
889
1556
1263
631
570
1343
1218
620
972
1398
872
537
1020
1396
362
1302
741
1231
431
500
894
920
358
985
104
1359
643
1147
365
1369
1472
882
812
1200
1543
1201
1547
1117
1410
1391
98
1444
1564
413
1105
161
386
1024
154
1119
135
1297
1501
39
1511
55
244
107
74
1442
809
12
957
1560
346
421
883
521
761
440
157
551
679
1243
1331
288
758
942
914
808
515
1495
1387
589
1241
347
94
1126
1250
408
306
1181
1457
294
938
1317
1371
1353
320
1239
1176
1080
96
1366
640
556
155
1078
241
718
504
1172
190
171
571
51
319
524
927
469
845
1075
1227
339
1055
1208
751
1188
57
1507
349
650
839
1003
430
70
364
1177
600
1154
7
331
795
1584
473
179
514
790
127
428
523
229
748
489
453
1321
450
961
1061
321
260
1512
869
405
963
860
64
224
828
1151
1462
964
626
1516
856
1568
673
763
685
743
1436
295
1478
1230
276
1111
1251
610
9
530
789
258
1233
1217
666
1298
1220
1510
516
1370
452
58
1406
1033
681
253
527
1281
962
752
25
1323
632
1265
353
586
1292
273
169
1110
488
33
278
577
1030
1309
215
875
953
801
764
425
1180
477
1090
44
1485
858
1357
1207
1271
855
825
1519
797
1137
1089
254
192
1367
1440
726
1301
393
771
356
414
1157
231
1380
851
1068
17
427
960
3
1400
399
1405
547
607
633
581
1248
608
695
644
47
1085
1041
615
777
1500
1205
1505
493
29
1278
1306
359
337
716
1178
1296
669
162
902
1504
392
760
424
237
661
13
1530
474
811
390
1123
1195
65
757
1403
1523
739
767
1088
1473
1443
928
1054
1479
245
877
509
1452
256
1240
416
1286
451
787
978
1287
1429
609
692
814
18
345
1006
41
829
1384
1229
1341
1198
663
1586
40
444
638
102
1060
557
595
208
54
1004
710
1146
357
776
322
415
1344
249
1149
19
574
587
280
526
1582
1536
908
1132
531
535
1131
378
1363
42
1335
935
163
970
1012
866
116
99
671
1206
1016
1467
487
1330
300
899
270
108
1011
101
1454
711
1573
966
1192
395
818
973
1274
667
236
1280
732
923
884
1525
228
896
585
11
261
445
4
409
1432
148
1583
49
468
181
482
170
959
1256
456
929
1379
684
1486
302
180
1468
1459
1109
247
1019
248
97
1232
126
834
1071
1072
330
1546
311
637
266
874
449
259
1152
1332
742
598
30
1289
850
725
800
1569
688
936
8
1193
1167
734
1421
1356
1100
20
272
1148
505
480
1340
462
174
439
151
417
822
565
123
1448
536
1460
655
1279
1
539
646
187
996
905
463
1390
1166
707
1007
1307
573
854
873
83
1471
770
307
351
1458
255
82
1539
1517
1067
1419
533
1527
426
32
1228
975
987
1305
1558
380
746
680
984
1045
852
478
982
166
137
1487
1577
290
308
199
461
217
735
1480
588
913
490
583
1386
56
979
388
1001
597
529
709
1534
223
1451
1392
471
132
37
926
354
1360
826
1039
368
1430
61
1140
567
861
1372
830
1235
277
550
756
197
323
475
292
24
522
367
534
324
1051
1528
907
755
177
868
540
1184
753
183
1401
706
1561
754
31
1532
1246
435
898
859
1091
411
744
699
1210
946
202
95
134
705
1322
113
1094
737
572
584
1581
1389
1267
1053
568
876
121
1221
257
233
62
954
1185
398
271
1496
1435
722
1170
1329
1130
727
85
1316
297
1282
312
543
891
886
348
965
1441
1009
410
871
1093
1521
1127
335
1285
622
317
1553
1422
1509
604
213
510
1203
91
1064
691
372
702
664
265
1326
301
325
389
507
281
986
227
1385
917
1531
1434
976
980
60
422
649
1087
329
1481
1483
1587
124
1083
377
1383
762
552
1245
728
974
111
686
582
1164
195
1168
26
326
821
628
494
1125
546
1550
230
304
391
519
1346
153
1253
1381
1559
879
1124
678
437
919
630
279
184
1269
553
575
1348
618
1114
73
315
112
465
464
350
267
34
252
182
1028
606
548
131
844
1046
545
1171
1537
999
842
1145
712
327
1418
176
580
76
1113
1312
360
342
772
1425
491
700
719
563
745
193
1428
147
1465
1566
1036
382
332
823
733
846
870
1466
1590
1081
636
225
1488
903
994
1291
1414
1272
1112
769
683
1336
932
52
1578
1552
853
165
1474
838
1303
1120
918
1183
117
511
1202
200
803
287
1351
1508
943
499
1047
338
1035
759
599
1358
824
1333
559
1420
143
634
1254
1196
1106
429
1408
1544
677
603
1368
159
89
1133
1160
890
1052
862
1213
1226
554
470
1223
1482
110
1238
1049
1062
1121
1439
188
1352
947
243
48
1424
601
484
778
178
397
84
909
1475
888
612
1017
897
1040
1153
549
937
1311
933
731
1426
1150
921
1182
1445
1224
564
629
895
750
264
1268
152
198
512
1407
694
541
1204
922
222
653
696
528
657
1076
723
1399
621
1038
1506
1187
485
1522
1549
806
419
1174
246
904
318
115
1275
841
1063
1050
284
1294
864
1023
118
201
713
158
1141
502
1453
1058
783
145
214
189
226
1538
1318
1237
1098
837
1143
831
1103
262
730
654
941
639
1031
210
798
782
1189
819
1249
1328
1048
1095
517
820
78
1222
701
1339
434
1394
1347
1567
1056
967
1320
79
949
1026
443
990
910
532
1412
708
794
1266
81
1497
1155
36
1115
433
1402
736
291
1107
703
1541
1361
1433
1450
457
1427
1554
1591
1524
336
130
50
0
668
865
1262
14
1557
647
1580
815
407
1314
988
1284
1513
454
1159
1134
1163
1491
562
283
796
448
1156
313
403
467
958
1277
645
738
1295
402
1138
120
508
212
885
1438
538
616
747
698
370
1382
1074
566
119
1411
1135
375
1086
1293
1313
1492
627
916
1579
788
518
1059
931
1349
1464
221
146
150
1255
930
303
90
1144
438
867
10
1260
5
293
235
1002
799
689
1247
827
418
286
1310
149
1300
848
263
642
122
611
863
724
205
1162
1338
1005
1388
105
495
1175
779
911
80
384
835
1139
1173
1455
458
1535
1288
404
775
296
1069
785
385
441
1214
1102
1493
991
900
481
420
1000
1191
1008
289
881
167
660
446
43
1022
1446
558
1199
847
109
472
1456
1273
1077
768
1304
1042
924
1484
1345
944
687
447
717
652
125
833
849
185
802
206
721
1209
729
1324
1514
1572
648
614
623
1520
71
1259
498
672
934
765
715
218
656
513
207
1073
1122
1431
138
492
72
592
363
1244
69
843
590
28
1375
1010
369
781
1021
172
1044
1342
766
298
674
939
1025
951
1129
1043
139
27
1423
1515
1161
1350
282
334
1397
1257
1315
21
651
992
194
219
1066
1337
1378
969
1447
906
232
952
164
1545
1404
619
813
1108
784
635
1518
605
396
1413
542
817
1542
560
1013
1186
412
